# Ultralytics YOLOv8.0n custom architecture with ECA
# Parameters
nc: 23  # number of classes
depth_multiple: 0.33
width_multiple: 0.25

# Anchors
anchors: null

# Backbone
backbone:
  - [-1, 1, Conv, [16, 3, 2]]
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 2, C2f, [32, True]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 4, C2f, [64, True]]
  - [-1, 1, ECA, [16]]      # <<< Using ECA instead of CBAM
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 4, C2f, [128, True]]
  - [-1, 1, ECA, [32]]      # <<< Using ECA instead of CBAM
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C2f, [256, True]]
  - [-1, 1, ECA, [64]]      # <<< Using ECA instead of CBAM
  - [-1, 1, SPPF, [256, 5]]

# Head (Corrected indices for the ECA architecture)
head:
  - [-1, 1, nn.Upsample, [null, 2, 'nearest']]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C2f, [128, False]]
  - [-1, 1, nn.Upsample, [null, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # Corrected connection to layer 5
  - [-1, 2, C2f, [64, False]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C2f, [128, False]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C2f, [256, False]]
  - [[18, 21, 24], 1, Detect, [nc]]